/* 
  COS2101 การเขียนโปรแกรมเชิงกระบวนคำสั่ง ครั้งที่ 1
  TH 24 Nov 2022 @SCL211/1 RU1
  
  2)  แลกแบงค์ 1000, 500, 100, 50 และ 20 จากเหรียญบาท 
      โดยให้ได้จำนวนแบงค์ และเหลือเหรียญน้อยที่สุด
*/

#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
  int coin, M, D, C, L, XX, I;

  SetConsoleOutputCP(CP_UTF8);

  cout << "ป้อนจำนวนเหรียญบาท ฿" << endl;
  cin >> coin;

  M = coin / 1000;
  D = coin % 1000 / 500;
  C = coin % 1000 % 500 / 100;
  L = coin % 1000 % 500 % 100 / 50;
  XX = coin % 1000 % 500 % 100 % 50 / 20;
  I = coin % 1000 % 500 % 100 % 50 % 20;

  cout << "เหรียญบาทจำนวน " << coin << " เหรียญ แลก" << endl;
  cout << "ธนบัตร 1,000 บาท ได้ " << M << " ฉบับ" << endl;
  cout << "ธนบัตร 500 บาท ได้ " << D << " ฉบับ" << endl;
  cout << "ธนบัตร 100 บาท ได้ " << C << " ฉบับ" << endl;
  cout << "ธนบัตร 50 บาท ได้ " << L << " ฉบับ" << endl;
  cout << "ธนบัตร 20 บาท ได้ " << XX << " ฉบับ" << endl;
  cout << "และเหลือเหรีญบาทจำนวน " << I << " เหรียญ" << endl;

  return 0;
}